[{"id":1,"name":"Harry Potter and Chamber of Secrets","type":"fiction","author":"J.K. Rowling","description":"Harry Potter's summer has included the worst birthday ever, doomy warnings from a house-elf called Dobby, and rescue from the Dursleys by his friend Ron Weasley in a magical flying car! Back at Hogwarts School of Witchcraft and Wizardry for his second year, Harry hears strange whispers echo through empty corridors - and then the attacks start. Students are found as through turned to stone . Dobby's sinister predictions seem to be coming true.These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON .","cover":"https://m.media-amazon.com/images/I/81S0LnPGGUL.jpg","available":false},{"id":2,"name":"Just as I Am","type":"Autobiography","author":"Billy Graham","description":"Hailed as 'the world's preacher,' Billy Graham enjoyed a career that spanned six decades and his ministry of faith touched the hearts and souls of millions.In Just As I Am, a #1 New York Times Bestseller, Graham reveals his life story in what the Chicago Tribune calls 'a disarmingly honest autobiography.' With down-to-earth warmth and candor, Graham tells the stories of the events and encounters that helped shape his life. He recounts meetings with presidents, celebrities, and world leaders, including Harry S. Truman, Winston Churchill, Queen Elizabeth, and the Shah of Iran, and shares his own spiritual journey as he movingly reflects on his personal life and relationships. This is an inspirational and unforgettable portrait that will be treasured by readers everywhere.","cover":"https://m.media-amazon.com/images/I/51WJ7-k0AML.jpg","available":true},{"id":3,"name":"The Vanishing Half","type":"fiction","author":"Brit Benett","description":"From The New York Times-bestselling author of The Mothers, a stunning new novel about twin sisters, inseparable as children, who ultimately choose to live in two very different worlds, one black and one white.The Vignes twin sisters will always be identical. But after growing up together in a small, southern black community and running away at age sixteen, it's not just the shape of their daily lives that is different as adults, it's everything: their families, their communities, their racial identities. Many years later, one sister lives with her black daughter in the same southern town she once tried to escape. The other secretly passes for white, and her white husband knows nothing of her past. Still, even separated by so many miles and just as many lies, the fates of the twins remain intertwined. What will happen to the next generation, when their own daughters' storylines intersect?Weaving together multiple strands and generations of this family, from the Deep South to California, from the 1950s to the 1990s, Brit Bennett produces a story that is at once a riveting, emotional family story and a brilliant exploration of the American history of passing. Looking well beyond issues of race, The Vanishing Half considers the lasting influence of the past as it shapes a person's decisions, desires, and expectations, and explores some of the multiple reasons and realms in which people sometimes feel pulled to live as something other than their origins. As with her New York Times-bestselling debut The Mothers, Brit Bennett offers an engrossing page-turner about family and relationships that is immersive and provocative, compassionate and wise.","cover":"https://m.media-amazon.com/images/I/81ICvbFe2+L.jpg","available":false},{"id":4,"name":"The Midnight Library","type":"fiction","author":"Matt Haig","description":"Nora's life has been going from bad to worse. Then at the stroke of midnight on her last day on earth she finds herself transported to a library. There she is given the chance to undo her regrets and try out each of the other lives she might have lived. Which raises the ultimate question: with infinite choices, what is the best way to live?","cover":"https://m.media-amazon.com/images/I/51n4BlaMF-L.jpg","available":true},{"id":5,"name":"Untamed","type":"non-fiction","author":"Glennon Doyle","description":"It is phenomenal.”—Elizabeth Gilbert, author of City of Girls and Eat Pray LoveThis is how you find yourself.There is a voice of longing inside each woman. We strive so mightily to be good: good partners, daughters, mothers, employees, and friends. We hope all this striving will make us feel alive. Instead, it leaves us feeling weary, stuck, overwhelmed, and underwhelmed. We look at our lives and wonder: Wasn’t it all supposed to be more beautiful than this? We quickly silence that question, telling ourselves to be grateful, hiding our discontent—even from ourselves. For many years, Glennon Doyle denied her own discontent. Then, while speaking at a conference, she looked at a woman across the room and fell instantly in love. Three words flooded her mind: There She Is. At first, Glennon assumed these words came to her from on high. But she soon realized they had come to her from within. This was her own voice—the one she had buried beneath decades of numbing addictions, cultural conditioning, and institutional allegiances. This was the voice of the girl she had been before the world told her who to be. Glennon decided to quit abandoning herself and to instead abandon the world’s expectations of her. She quit being good so she could be free. She quit pleasing and started living. Soulful and uproarious, forceful and tender, Untamed is both an intimate memoir and a galvanizing wake-up call. It is the story of how one woman learned that a responsible mother is not one who slowly dies for her children, but one who shows them how to fully live.","cover":"https://m.media-amazon.com/images/I/91pIT84uoVL.jpg","available":true},{"id":6,"name":"Viscount Who Loved Me","type":"fiction","author":"Julia Quinn","description":"But this time, the gossip columnists have it wrong. Anthony Bridgerton hasn't just decided to marry—he's even chosen a wife! The only obstacle is his intended's older sister, Kate Sheffield—the most meddlesome woman ever to grace a London ballroom. The spirited schemer is driving Anthony mad with her determination to stop the betrothal, but when he closes his eyes at night, Kate is the woman haunting his increasingly erotic dreams...Contrary to popular belief, Kate is quite sure that reformed rakes do not make the best husbands—and Anthony Bridgerton is the most wicked rogue of them all. Kate is determined to protect her sister—but she fears her own heart is vulnerable. And when Anthony's lips touch hers, she's suddenly afraid she might not be able to resist the reprehensible rake herself...","cover":"https://m.media-amazon.com/images/I/51MXIg+n28L.jpg","available":false},{"id":7,"name":"The Queen Will Betray You","type":"fiction","author":"Sarah Henning","description":"The Queen Will Betray You is an epic sequel to The Princess Will Save You! The story picks up right where the first book left off, and it is action-packed, riddled with danger, intrigue, treachery, and more. I love that the series pays homage to The Princess Bride while still feeling wholly original.","cover":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1616104596l/55077665.jpg","available":true},{"id":8,"name":"The Catcher in the Rye","type":"fiction","author":"J.D. Salinger","description":"Fleeing the crooks at Pencey Prep, he pinballs around New York City seeking solace in fleeting encounters—shooting the bull with strangers in dive hotels, wandering alone round Central Park, getting beaten up by pimps and cut down by erstwhile girlfriends. The city is beautiful and terrible, in all its neon loneliness and seedy glamour, its mingled sense of possibility and emptiness. Holden passes through it like a ghost, thinking always of his kid sister Phoebe, the only person who really understands him, and his determination to escape the phonies and find a life of true meaning.","cover":"https://www.oberlo.com/media/1603897573-image35.jpg?w=1824&fit=max","available":true},{"id":9,"name":"The Merchant of Venice","type":"fiction","author":"William Shakespeare","description":"This early work of Shakespeare is considered to be the finest and most thought-provoking of all comedies of his time. Being so, it carries the universal theme of good triumphing over evil,as it depicts the interplay of vengeance and shrewdness. Antonio, the merchant of Venice borrows money from the money-obsessed loan shark Shylock to help his friend Bassanio marry Portia, his lady love. He in fact offers himself as collateral for the loan, agreeing to Shylock’s terms-to cut a pound of flesh from his body- on failure to repay the loan, and now Shylock demands his flesh. Portia comes to Antonio’s rescue. How she outwits Shylock forms the rest of the story. The play can be well studied as a commentary on the racial and religious interactions of the English society of the 16th century. In terms of themes, the play reiterates along its course, the divine qualities of mercy and compassion that lie beneath the flesh.","cover":"https://www.discoverwalks.com/blog/wp-content/uploads/2022/03/the-merchant-of-venis-flickr.jpg","available":true},{"id":10,"name":"I Know Why the Caged Bird Sings","type":"fiction","author":"Maya Angelou","description":"Maya Angelou’s debut memoir is a modern American classic beloved worldwide. Her life story is told in the documentary film And Still I Rise, as seen on PBS’s American Masters.Here is a book as joyous and painful, as mysterious and memorable, as childhood itself. I Know Why the Caged Bird Sings captures the longing of lonely children, the brute insult of bigotry, and the wonder of words that can make the world right. Maya Angelou’s debut memoir is a modern American classic beloved worldwide.Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local 'powhitetrash.' At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime.","cover":"https://prodimage.images-bn.com/pimages/9780345514400_p0_v2_s192x300.jpg","available":true}]